# UnitTypeId Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId Class
Members See Also
---
This class contains constants identifying units of measurement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static class UnitTypeId
```

Visual Basic
---
```text
Public NotInheritable Class UnitTypeId
```

Visual C++
---
```text
public ref class UnitTypeId abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..UnitTypeId
# See Also
UnitTypeId Members
Autodesk.Revit.DB Namespace